io_test/results/run7/fio.log
>>>>>>> Test 1 (5 8 8 0.250000)job1: (g=0): rw=randwrite, bs=128K-128K/128K-128K/128K-128K, ioengine=libaio, iodepth=128
fio-2.2.9-32-gf02f
Starting 1 process

job1: (groupid=0, jobs=1): err= 0: pid=31691: Fri Aug 21 01:38:37 2015
  write: io=307200MB, bw=194845KB/s, iops=1522, runt=1614474msec
    slat (usec): min=47, max=63253, avg=318.25, stdev=1509.46
    clat (usec): min=0, max=1215.6K, avg=33281.45, stdev=66807.44
     lat (usec): min=50, max=1259.4K, avg=33600.00, stdev=67301.01
    clat percentiles (usec):
     |  1.00th=[    1],  5.00th=[    1], 10.00th=[    1], 20.00th=[    1],
     | 30.00th=[    2], 40.00th=[    2], 50.00th=[ 6752], 60.00th=[ 7904],
     | 70.00th=[33536], 80.00th=[62720], 90.00th=[95744], 95.00th=[132096],
     | 99.00th=[288768], 99.50th=[399360], 99.90th=[708608], 99.95th=[782336],
     | 99.99th=[1105920]
    bw (KB  /s): min=    0, max=2374656, per=100.00%, avg=250459.40, stdev=274988.16
    lat (usec) : 2=26.14%, 4=23.65%, 10=0.17%, 20=0.03%, 50=0.01%
    lat (usec) : 100=0.01%, 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
    lat (msec) : 2=0.01%, 4=0.01%, 10=15.00%, 20=0.64%, 50=9.83%
    lat (msec) : 100=15.04%, 250=8.19%, 500=1.00%, 750=0.22%, 1000=0.07%
    lat (msec) : 2000=0.01%
  cpu          : usr=1.32%, sys=19.64%, ctx=1353424, majf=0, minf=16806
  IO depths    : 1=50.0%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=50.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=0/w=2457600/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
  WRITE: io=307200MB, aggrb=194845KB/s, minb=194845KB/s, maxb=194845KB/s, mint=1614474msec, maxt=1614474msec

Disk stats (read/write):
  rbd4: ios=0/1134729, merge=0/66290974, ticks=0/220308500, in_queue=220356768, util=97.46%
>>>>>>> Test 2 (2 3 20 1.000000)job1: (g=0): rw=randwrite, bs=128K-128K/128K-128K/128K-128K, ioengine=libaio, iodepth=128
fio-2.2.9-32-gf02f
Starting 1 process

job1: (groupid=0, jobs=1): err= 0: pid=26027: Fri Aug 21 02:30:19 2015
  write: io=375000MB, bw=256000KB/s, iops=2000, runt=1500001msec
    slat (usec): min=46, max=59268, avg=134.36, stdev=561.81
    clat (usec): min=0, max=1043.8K, avg=5952.26, stdev=25073.44
     lat (usec): min=47, max=1043.1K, avg=6086.93, stdev=25249.70
    clat percentiles (usec):
     |  1.00th=[    1],  5.00th=[    1], 10.00th=[    1], 20.00th=[    1],
     | 30.00th=[    1], 40.00th=[    1], 50.00th=[    2], 60.00th=[    2],
     | 70.00th=[    2], 80.00th=[ 6880], 90.00th=[ 7840], 95.00th=[40704],
     | 99.00th=[80384], 99.50th=[86528], 99.90th=[257024], 99.95th=[464896],
     | 99.99th=[937984]
    bw (KB  /s): min=    0, max=2362880, per=100.00%, avg=304100.87, stdev=309009.76
    lat (usec) : 2=44.62%, 4=29.92%, 10=0.22%, 20=0.04%, 50=0.01%
    lat (usec) : 100=0.01%, 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
    lat (msec) : 2=0.01%, 4=0.01%, 10=17.81%, 20=0.03%, 50=3.82%
    lat (msec) : 100=3.26%, 250=0.17%, 500=0.06%, 750=0.02%, 1000=0.02%
    lat (msec) : 2000=0.01%
  cpu          : usr=1.81%, sys=24.60%, ctx=2318112, majf=0, minf=7110
  IO depths    : 1=74.8%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=25.2%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=3000003/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
  WRITE: io=375000MB, aggrb=256000KB/s, minb=256000KB/s, maxb=256000KB/s, mint=1500001msec, maxt=1500001msec

Disk stats (read/write):
  rbd4: ios=0/1520147, merge=0/88135961, ticks=0/228218240, in_queue=228206216, util=95.59%
>>>>>>> Test 3 (3 5 20 1.000000)job1: (g=0): rw=randwrite, bs=128K-128K/128K-128K/128K-128K, ioengine=libaio, iodepth=128
fio-2.2.9-32-gf02f
Starting 1 process

job1: (groupid=0, jobs=1): err= 0: pid=35231: Fri Aug 21 03:18:28 2015
  write: io=307200MB, bw=158726KB/s, iops=1240, runt=1981865msec
    slat (usec): min=47, max=31240, avg=303.90, stdev=1257.30
    clat (usec): min=0, max=536033, avg=33022.58, stdev=42937.36
     lat (usec): min=49, max=563217, avg=33326.80, stdev=43236.05
    clat percentiles (usec):
     |  1.00th=[    1],  5.00th=[    1], 10.00th=[    1], 20.00th=[    1],
     | 30.00th=[    2], 40.00th=[ 6880], 50.00th=[ 7776], 60.00th=[33024],
     | 70.00th=[51968], 80.00th=[62720], 90.00th=[88576], 95.00th=[120320],
     | 99.00th=[175104], 99.50th=[240640], 99.90th=[313344], 99.95th=[362496],
     | 99.99th=[528384]
    bw (KB  /s): min=    0, max=2347776, per=100.00%, avg=280917.70, stdev=269789.14
    lat (usec) : 2=22.16%, 4=16.77%, 10=0.25%, 20=0.02%, 50=0.01%
    lat (usec) : 100=0.01%, 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
    lat (msec) : 2=0.01%, 4=0.01%, 10=12.95%, 20=0.94%, 50=16.39%
    lat (msec) : 100=21.79%, 250=8.42%, 500=0.26%, 750=0.02%
  cpu          : usr=1.07%, sys=16.16%, ctx=1086728, majf=0, minf=25689
  IO depths    : 1=39.2%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=60.8%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=0/w=2457600/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
  WRITE: io=307200MB, aggrb=158725KB/s, minb=158725KB/s, maxb=158725KB/s, mint=1981865msec, maxt=1981865msec

Disk stats (read/write):
  rbd4: ios=0/1172819, merge=0/72629673, ticks=0/204817948, in_queue=204798692, util=97.15%
>>>>>>> Test 4 (3 5 20 1.000000)job1: (g=0): rw=randwrite, bs=128K-128K/128K-128K/128K-128K, ioengine=libaio, iodepth=128
fio-2.2.9-32-gf02f
Starting 1 process

job1: (groupid=0, jobs=1): err= 0: pid=28668: Fri Aug 21 03:45:12 2015
  write: io=347448MB, bw=237191KB/s, iops=1853, runt=1500001msec
    slat (usec): min=41, max=39431, avg=275.96, stdev=1144.58
    clat (usec): min=0, max=451812, avg=28328.06, stdev=41271.11
     lat (usec): min=42, max=451895, avg=28604.32, stdev=41554.23
    clat percentiles (usec):
     |  1.00th=[    1],  5.00th=[    1], 10.00th=[    1], 20.00th=[    1],
     | 30.00th=[    2], 40.00th=[    2], 50.00th=[ 6880], 60.00th=[ 7840],
     | 70.00th=[48896], 80.00th=[60160], 90.00th=[94720], 95.00th=[111104],
     | 99.00th=[156672], 99.50th=[191488], 99.90th=[276480], 99.95th=[321536],
     | 99.99th=[448512]
    bw (KB  /s): min=    0, max=2359552, per=100.00%, avg=280663.40, stdev=285762.67
    lat (usec) : 2=26.66%, 4=19.67%, 10=0.29%, 20=0.03%, 50=0.01%
    lat (usec) : 100=0.01%, 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
    lat (msec) : 2=0.01%, 4=0.01%, 10=15.45%, 20=0.73%, 50=9.53%
    lat (msec) : 100=18.46%, 250=9.01%, 500=0.16%
  cpu          : usr=1.72%, sys=23.39%, ctx=1432174, majf=0, minf=13334
  IO depths    : 1=46.7%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=53.3%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=0/w=2779581/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
  WRITE: io=347448MB, aggrb=237190KB/s, minb=237190KB/s, maxb=237190KB/s, mint=1500001msec, maxt=1500001msec

Disk stats (read/write):
  rbd4: ios=0/1280686, merge=0/77675335, ticks=0/18446744069641588692, in_queue=18446744069641823724, util=94.84%
>>>>>>> Test 5 (3 5 10 1.000000)job1: (g=0): rw=randwrite, bs=128K-128K/128K-128K/128K-128K, ioengine=libaio, iodepth=128
fio-2.2.9-32-gf02f
Starting 1 process

job1: (groupid=0, jobs=1): err= 0: pid=25860: Fri Aug 21 04:20:45 2015
  write: io=375000MB, bw=256000KB/s, iops=2000, runt=1500001msec
    slat (usec): min=41, max=20323, avg=145.13, stdev=549.00
    clat (usec): min=0, max=160121, avg=7904.73, stdev=20817.55
     lat (usec): min=42, max=160300, avg=8050.15, stdev=20946.65
    clat percentiles (usec):
     |  1.00th=[    1],  5.00th=[    1], 10.00th=[    1], 20.00th=[    1],
     | 30.00th=[    1], 40.00th=[    1], 50.00th=[    2], 60.00th=[    2],
     | 70.00th=[    2], 80.00th=[ 6944], 90.00th=[33536], 95.00th=[54528],
     | 99.00th=[103936], 99.50th=[103936], 99.90th=[144384], 99.95th=[156672],
     | 99.99th=[156672]
    bw (KB  /s): min=    0, max=2370816, per=100.00%, avg=299957.72, stdev=292797.39
    lat (usec) : 2=43.62%, 4=28.69%, 10=0.52%, 20=0.04%, 50=0.01%
    lat (usec) : 100=0.01%, 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
    lat (msec) : 2=0.01%, 4=0.01%, 10=16.27%, 20=0.19%, 50=4.35%
    lat (msec) : 100=4.99%, 250=1.30%
  cpu          : usr=1.80%, sys=24.35%, ctx=2266435, majf=0, minf=8757
  IO depths    : 1=72.9%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=27.1%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=3000003/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
  WRITE: io=375000MB, aggrb=256000KB/s, minb=256000KB/s, maxb=256000KB/s, mint=1500001msec, maxt=1500001msec

Disk stats (read/write):
  rbd4: ios=0/1561368, merge=0/87486579, ticks=0/222558648, in_queue=222566120, util=94.02%